library('jsonlite')
library(ggplot2)

jsonList = fromJSON('시청 기록.json')
시간문자열<-jsonList["time"]

시간<-replicate(24, 0)


for (i in 1:dim(시간문자열)[1]) {#UTC라 +9
    시간[10]<-시간[10]+grepl("T01",시간문자열[[1]][[i]])
    시간[11]<-시간[11]+grepl("T02",시간문자열[[1]][[i]])
    시간[12]<-시간[12]+grepl("T03",시간문자열[[1]][[i]])
    시간[13]<-시간[13]+grepl("T04",시간문자열[[1]][[i]])
    시간[14]<-시간[14]+grepl("T05",시간문자열[[1]][[i]])
    시간[15]<-시간[15]+grepl("T06",시간문자열[[1]][[i]])
    시간[16]<-시간[16]+grepl("T07",시간문자열[[1]][[i]])
    시간[17]<-시간[17]+grepl("T08",시간문자열[[1]][[i]])
    시간[18]<-시간[18]+grepl("T09",시간문자열[[1]][[i]])
    시간[19]<-시간[19]+grepl("T10",시간문자열[[1]][[i]])
    시간[20]<-시간[20]+grepl("T11",시간문자열[[1]][[i]])
    시간[21]<-시간[21]+grepl("T12",시간문자열[[1]][[i]])
    시간[22]<-시간[22]+grepl("T13",시간문자열[[1]][[i]])
    시간[23]<-시간[23]+grepl("T14",시간문자열[[1]][[i]])
    시간[24]<-시간[24]+grepl("T15",시간문자열[[1]][[i]])
    시간[1]<-시간[1]+grepl("T16",시간문자열[[1]][[i]])
    시간[2]<-시간[2]+grepl("T17",시간문자열[[1]][[i]])
    시간[3]<-시간[3]+grepl("T18",시간문자열[[1]][[i]])
    시간[4]<-시간[4]+grepl("T19",시간문자열[[1]][[i]])
    시간[5]<-시간[5]+grepl("T20",시간문자열[[1]][[i]])
    시간[6]<-시간[6]+grepl("T21",시간문자열[[1]][[i]])
    시간[7]<-시간[7]+grepl("T22",시간문자열[[1]][[i]])
    시간[8]<-시간[8]+grepl("T23",시간문자열[[1]][[i]])
    시간[9]<-시간[9]+grepl("T00",시간문자열[[1]][[i]])
}
시각 <- c(0:23)
df<-data.frame(시간,시각)

ggplot(data = df, aes(x = 시각,y=시간)) +  geom_line()
